Repository: hfukuchi/SPDX_specification
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: These may be referenced internally and externally with the addition of the SPDX
ja: これらは、内部から参照され、SPDX文書識別子と組み合わせて外部からも参照される。

source: These may be referenced internally and externally with the addition of the SPDX Document Identifier.
ja: これらは、内部から参照され、SPDX文書識別子と組み合わせて外部からも参照される。

source: This SPDX file was created by a combination of using a free tool, as indicated above, and manual analysis by several authors of the code.
ja: このSPDXファイルは、上記のフリーツールとコードの著者によるマニュアル解析で生成された。

source: This VCS location compact notation (inspired and mostly adopted from
ja: このVCS位置簡潔表記（以下から影響を受け採用された

source: This VCS location compact notation (inspired and mostly adopted from https://pip.pypa.io/en/latest/reference/pip_install.html#vcs-support as of 20150220) supports referencing locations in version control systems such as Git, Mercurial, Subversion and Bazaar, and specifies the type of VCS tool using url prefixes: “git+”, “hg+”, “bzr+”, “svn+” and specific transport schemes such as SSH or HTTPS.
ja: このVCS位置簡易表記（https://pip.pypa.io/en/latest/reference/pip_install.html#vcs­support 20150220時点 からヒントを受け採用している) は、Git、Mercurial、Subversion、Bazaarなどのバージョン コントロール システム内の位置参照をサポートする。URL接頭子：: “git+”, “hg+”, “bzr+”, “svn+”とSSHやHTTPのようなトランスポート スキーム を使ってVCSツール タイプを特定する。

source: This allows the outside project to be represented by a single SPDX identifier (the identifier of Package B).
ja: これは、外部プロジェクトを1つのSPDX識別子（Package Bの識別子）で表現することを可能にする。

source: This anticipates that in the future, an SPDX file may have used a version of the SPDX License List that is older than the then current one.
ja: このことは、将来、現行のものより古いバージョンのSPDXライセンス リストがSPDXで使用されることを見越している。

source: This approach avoids intellectual property and related restrictions over the SPDX file, however individuals can still contract with each other to restrict release of specific collections of SPDX files (which map to software bill of materials) and the identification of the supplier of SPDX files.
ja: このアプローチは、SPDXファイルに関する知的財産や関連する制限事項を避けている。しかしながら、それでも、個人は相互にSPDXファイルの特定集合（ソフトウェアBOMを構成）のリリースやSPDXファイルの提供者の特定を制限する約束をすることができる。

source: This document was created using SPDX 2.0 using licenses from the web site.
ja: この文書は、ウェブサイトからのライセンスを使い、SPDX2.0に従って作成された。

source: This document was created using SPDX 2.0, version 2.3 of the SPDX License List and refering to licenses in file MyCompany.Approved.Licenses.spdx.
ja: この文書は、ウェブサイトからのライセンスを使い、SPDX2.0に従って作成された。

source: This field is distinct from the fields in section 7, which involves the addition of information during a subsequent review.
ja: このフィールドは、後続のレビューにおいて情報を追加できる、7節で定義のフィールドとは区別される。

source: This field is vital for ensuring that downstream package recipients can address any ambiguity or concerns that might arise with the information in the SPDX file or the contents of the package it documents.
ja: このフィールドは、ダウンストリーム パッケージ受領者がSPDXファイルの情報やパッケージの内容についての曖昧さや懸念を直接伝えるのを確実にする。

source: This field is vital for understanding who originally distributed a package and should help in addressing any ambiguity or concerns that might arise with the information in the SPDX file or the contents of the Package it documents.
ja: このフィールドは、このフィールドは、ダウンストリーム パッケージ受領者がSPDXファイルの情報やパッケージの内容についての曖昧さや懸念を直接伝えるのを確実にする。

source: This identifier enables a recipient to determine if any file in the original package (that the analysis was done on) has been changed and permits inclusion of an SPDX file as part of a package.
ja: この識別子は、オリジナルパッケージに含まれていたファイルが変更されたことを受領者によって確認できるようにし、パッケージの一部としてSPDXファイルを挿入することを可能にする。

source: This identifier enables a recipient to determine if any file in the original package has been changed.
ja: この識別子は、オリジナルパッケージに含まれるファイルが変更されたかどうかを受領者によって確認できるようにする。

source: This link can also be used to reference further information about the package referenced by the SPDX file creator.
ja: このリンクは、SPDXファイル作成者によって参照されたパッケージに対する情報にも使える。

source: This may include the packaging and compression methods used as part of the file name, if appropriate.
ja: 適用可能な場合、これには、ファイル名の一部として使われるパッケージング手法や圧縮手法も含まれる。

source: This may or may not be different from the originating distribution source for the package.
ja: これは、パッケージ原作者と同じ場合も異なる場合もありうる。

source: This saves the recipient of the SPDX file who is looking for more info from having to search for and verify a match between the package and the associated project homepage.
ja: これによって、追加情報を探しているSPDXファイル受領者は、探す手間とパッケージと関連するプロジェクト ホームページ間の整合性を確認する手間を省略できる。

source: This support is less important for SVN since the URL path can also contain sub-paths; this two forms are equivalent:
ja: URLパスはサブパスを含むことができるので、このサポートはSVNにとってはそれほど重要でない。この二つの形式は同じである：

source: This support is less important for SVN since the URL path can also contain sub?paths?
ja: このサポートは、URLパスはサブパスを含むことができるので、SVNにとってはそれほど重要でない。

source: This support is less important for SVN since the URL path can also contain sub­paths; this two forms are equivalent:
ja: ｋこのサポートは、URLパスはサブパスを含むことができるので、SVNにとってはそれほど重要でない。この二つの形式は同じである：

source: This work is licensed under the Creative Commons Attribution License 3.0 Unported (CC-BY-3.0) reproduced in its entirety in Appendix V herein.
ja: 本文書は、Appendix Vに表記されているCreative Commons Attribution License 3.0 Unported (CC-BY-3.0)でライセンスされている。

source: To create a set of data exchange standards that enable companies and organizations to share license and component information (metadata) for software packages and related content with the aim of facilitating license and other policy compliance.
ja: ソフトウェアや関連物に対するライセンスやコンポーネント情報（メタデータ）を、ライセンスや他のポリシー コンプライアンスの促進を目指して、企業や組織が共有するためのデータ交換規格を作成することを目的とする

source: To pass branch names, a commit hash, a tag name or a local branch name use the "@" delimiter:
ja: ブランチ名、コミット ハッシュ、タグ名を渡すために、"@"デリミターを使用する：

source: To reference another SPDX document in total, this identifier should be used with the external document identifier preceding it.
ja: 全体として他の文書を参照するため、この識別子は外部文書識別子と使われるべきである。

source: To specify a sub-path to a file or directory inside a repository use the "#" delimiter:
ja: リポジトリ内のファイルやディレクトリへのサブパスを指定するために、"#"デリミターを使用する：

source: To specify a sub?path to a file or directory inside a repository use the "#" delimiter:
ja: リポジトリ内のファイルやディレクトリへのサブパスを指定するために、"#"デリミターを使用する：

source: To specify a sub­path to a file or directory inside a repository use the "#" delimiter:
ja: リポジトリ内のファイルやディレクトリへのサブパスを指定するために、"#"デリミターを使用する：

source: To specify branch names, a commit hash or a tag name, use the "@" delimiter:
ja: ブランチ名、コミット ハッシュおよびタグ名を指定するために、"@"デリミターを使用する：

source: UUID is a universally unique identifier. The UUID could be a version 4 random UUID which can be generated from the Online UUID Generator or a version 5 UUID generated from a sha1 checksum known to be unique for this specific SPDX document version.
ja: UUIDは、universally unique identifierのことである。UUIDは、オンラインUUID生成器で生成されるバージョン4乱数UUIDか、この特定のSPDX文書バージョンには一意であると知られているSHA1チェックサムから生成されるバージョン5UUIDが利用可能である。

source: Use NOASSERTION if:
ja: 以下の場合にはNOASSERTIONを使用する。

source: Use NONE if there is no download location whatsoever.
ja: ダウンロード位置が一切ない場合にはNONEを使う。

source: User access control to URLs or VCS repositories must be handled outside of an SPDX document.
ja: URLやVCSリポジトリへのユーザー アクセス制御は、SPDX文書の外部で処理しなければならない。

source: Using user names and password in the host_name is not supported and should be considered as an error.
ja: host_nameにユーザー名やパスワードを使用するのはサポートされていないし、エラーと認識するべきである。

source: Using user names and password in the host_name is not supported and should be considered as an error. User access control to URLs or VCS repositories must be handled outside of an SPDX document.
ja: やhost_nameにユーザー名やパスワードを使用するのはサポートされていないし、エラーと認識するべきである。URLやVCSリポジトリへのユーザー アクセス制御は、SPDX文書の外部で処理しなければならない。

source: What does this specification cover?
ja: この仕様はどの項目をカバーしているか？

source: What is not covered in the specification?
ja: この仕様はどの項目をカバーしないか？

source: When there is no SPDX file information available to document the content of these external packages, then the filesAnnalyzed attribute on a package should be set to false.
ja: これらの外部パッケージを示すSPDXファイル情報が無い場合には、パッケージのfilesAnnalyzed属性はFalseにするべきである。

source: Why is a common format for data exchange needed?
ja: データ交換用の共通フォーマットはなぜ必要なのか？

source: With respect to NOASSERTION, a written explanation in the Comments on License field (section 3.15) is preferred.
ja: NOASSERTIONに関しては、Comments on License（ライセンスへのコメント、3.15節参照）フィールドに説明を記載した方良い。

source: With thanks to Adam Cohn, Andrew Back, Ann Thornton, Bill Schineller, Bruno Cornec, Ciaran Farrell, Daniel German, David Wheeler, Debra McGlade, Dennis Clark, Ed Warnicke, Eran Strod, Eric Thomas, Esteban Rockett, Gary O'Neall, Guillaume Rousseau, Hassib Khanafer, Jack Manbeck, Jaime Garcia, Jeff Luszcz, Jilayne Lovejoy, John Ellis, Karen Copenhaver, Kate Stewart, Kevin Mitchell, Kim Weins, Kirsten Newcomer, Kris Reeves, Liang Cao, Marc-Etienne Vargenau, Mark Gisi, Marshall Clow, Martin Michlmayr, Martin von Willebrand, Matt Germonprez, Michael J. Herzog, Michel Ruffin, Nuno Brito, Oliver Fendt, Paul Madick, Peter Williams, Phil Robb, Philip Odence, Philip Koltun, Phillippe Ombredanne, Pierre Lapointe, Rana Rahal, Robin Gandhi, Sam Ellis, Sameer Ahmed, Scott K Peterson, Scott Lamons, Scott Sterling, Shane Coughlan, Steve Cropper, Stuart Hughes, Tom Callaway, Tom Vidal, Thomas F. Incorvia, Venkata Krishna, Yev Bronshteyn, and Zachary McFarland for their contributions and assistance.
ja: 次の方々の貢献と支援に謝辞を贈る；Adam Cohn, Andrew Back, Ann Thornton, Bill Schineller, Bruno Cornec, Ciaran Farrell, Daniel German, David Wheeler, Debra McGlade, Dennis Clark, Ed Warnicke, Eran Strod, Eric Thomas, Esteban Rockett, Gary O'Neall, Guillaume Rousseau, Hassib Khanafer, Jack Manbeck, Jaime Garcia, Jeff Luszcz, Jilayne Lovejoy, John Ellis, Karen Copenhaver, Kate Stewart, Kevin Mitchell, Kim Weins, Kirsten Newcomer, Kris Reeves, Liang Cao, Marc-Etienne Vargenau, Mark Gisi, Marshall Clow, Martin Michlmayr, Martin von Willebrand, Matt Germonprez, Michael J. Herzog, Michel Ruffin, Nuno Brito, Oliver Fendt, Paul Madick, Peter Williams, Phil Robb, Philip Odence, Philip Koltun, Phillippe Ombredanne, Pierre Lapointe, Rana Rahal, Robin Gandhi, Sam Ellis, Sameer Ahmed, Scott K Peterson, Scott Lamons, Scott Sterling, Shane Coughlan, Steve Cropper, Stuart Hughes, Tom Callaway, Tom Vidal, Thomas F. Incorvia, Venkata Krishna, Yev Bronshteyn, and Zachary McFarland

source: With thanks to Adam Cohn, Andrew Back, Ann Thornton, Bill Schineller, Bruno Cornec, Ciaran Farrell, Daniel German, David Wheeler, Debra McGlade, Dennis Clark, Ed Warnicke, Eran Strod, Eric Thomas, Esteban Rockett, Gary O'Neall, Guillaume Rousseau, Hassib Khanafer, Jack Manbeck, Jaime Garcia, Jeff Luszcz, Jilayne Lovejoy, John Ellis, Karen Copenhaver, Kate Stewart, Kevin Mitchell, Kim Weins, Kirsten Newcomer, Kris Reeves, Liang Cao, Marc?Etienne Vargenau, Mark Gisi, Marshall Clow, Martin Michlmayr, Martin von Willebrand, Matt Germonprez, Michael J. Herzog, Michel Ruffin, Nuno Brito, Oliver Fendt, Paul Madick, Peter Williams, Phil Robb, Philip Odence, Philip Koltun, Phillippe Ombredanne, Pierre Lapointe, Rana Rahal, Robin Gandhi, Sam Ellis, Sameer Ahmed, Scott K Peterson, Scott Lamons, Scott Sterling, Shane Coughlan, Steve Cropper, Stuart Hughes, Tom Callaway, Tom Vidal, Thomas F. Incorvia, Venkata Krishna, Yev Bronshteyn, and Zachary McFarland for their contributions and assistance.
ja: 次の方々の貢献と支援に謝辞を贈る。 Adam Cohn, Andrew Back, Ann Thornton, Bill Schineller, Bruno Cornec, Ciaran Farrell, Daniel German, David Wheeler, Debra McGlade, Dennis Clark, Ed Warnicke, Eran Strod, Eric Thomas, Esteban Rockett, Gary O'Neall, Guillaume Rousseau, Hassib Khanafer, Jack Manbeck, Jaime Garcia, Jeff Luszcz, Jilayne Lovejoy, John Ellis, Karen Copenhaver, Kate Stewart, Kevin Mitchell, Kim Weins, Kirsten Newcomer, Kris Reeves, Liang Cao, Marc­Etienne Vargenau, Mark Gisi, Marshall Clow, Martin Michlmayr, Martin von Willebrand, Matt Germonprez, Michael J. Herzog, Michel Ruffin, Nuno Brito, Oliver Fendt, Paul Madick, Peter Williams, Phil Robb, Philip Odence, Philip Koltun, Phillippe Ombredanne, Pierre Lapointe, Rana Rahal, Robin Gandhi, Sam Ellis, Sameer Ahmed, Scott K Peterson, Scott Lamons, Scott Sterling, Shane Coughlan, Steve Cropper, Stuart Hughes, Tom Callaway, Tom Vidal, Thomas F. Incorvia, Venkata Krishna, Yev Bronshteyn, and Zachary McFarland

source: With thanks to Adam Cohn, Andrew Back, Ann Thornton, Bill Schineller, Bruno Cornec, Ciaran Farrell, Daniel German, David Wheeler, Debra McGlade, Dennis Clark, Ed Warnicke, Eran Strod, Eric Thomas, Esteban Rockett, Gary O'Neall, Guillaume Rousseau, Hassib Khanafer, Jack Manbeck, Jaime Garcia, Jeff Luszcz, Jilayne Lovejoy, John Ellis, Karen Copenhaver, Kate Stewart, Kevin Mitchell, Kim Weins, Kirsten Newcomer, Kris Reeves, Liang Cao, Marc­Etienne Vargenau, Mark Gisi, Marshall Clow, Martin Michlmayr, Martin von Willebrand, Matt Germonprez, Michael J. Herzog, Michel Ruffin, Nuno Brito, Oliver Fendt, Paul Madick, Peter Williams, Phil Robb, Philip Odence, Philip Koltun, Phillippe Ombredanne, Pierre Lapointe, Rana Rahal, Robin Gandhi, Sam Ellis, Sameer Ahmed, Scott K Peterson, Scott Lamons, Scott Sterling, Shane Coughlan, Steve Cropper, Stuart Hughes, Tom Callaway, Tom Vidal, Thomas F. Incorvia, Venkata Krishna, Yev Bronshteyn, and Zachary McFarland for their contributions and assistance.
ja: 次の方々の貢献と支援に謝辞を贈る。 Adam Cohn, Andrew Back, Ann Thornton, Bill Schineller, Bruno Cornec, Ciaran Farrell, Daniel German, David Wheeler, Debra McGlade, Dennis Clark, Ed Warnicke, Eran Strod, Eric Thomas, Esteban Rockett, Gary O'Neall, Guillaume Rousseau, Hassib Khanafer, Jack Manbeck, Jaime Garcia, Jeff Luszcz, Jilayne Lovejoy, John Ellis, Karen Copenhaver, Kate Stewart, Kevin Mitchell, Kim Weins, Kirsten Newcomer, Kris Reeves, Liang Cao, Marc­Etienne Vargenau, Mark Gisi, Marshall Clow, Martin Michlmayr, Martin von Willebrand, Matt Germonprez, Michael J. Herzog, Michel Ruffin, Nuno Brito, Oliver Fendt, Paul Madick, Peter Williams, Phil Robb, Philip Odence, Philip Koltun, Phillippe Ombredanne, Pierre Lapointe, Rana Rahal, Robin Gandhi, Sam Ellis, Sameer Ahmed, Scott K Peterson, Scott Lamons, Scott Sterling, Shane Coughlan, Steve Cropper, Stuart Hughes, Tom Callaway, Tom Vidal, Thomas F. Incorvia, Venkata Krishna, Yev Bronshteyn, and Zachary McFarland

source: Without opining on the lawfulness of "database rights" (in jurisdictions where applicable), such explanatory text is copyrightable subject matter in most Berne Convention countries.
ja: データベース権（適応可能な裁判権の中で）の適法性に言及しなくても、そのような説明文はほとんどのベルヌ条約国において著作権対象になる。

source: YYYY is year
ja: YYYY は年

source: You can specify a revision or tag using the "@" delimiter:
ja: "@"デリミターを使ってリビジョンを指定できる：

source: You can specify a revision using the "@" delimiter:
ja: "@"デリミターを使ってリビジョンを指定できる。

source: Zero (must be omitted) if filesAnalyzed is
ja: 0 (省略されないといけない) filesAnalyzedがFalseの場合

source: Zero (must be omitted) if filesAnalyzed is false.
ja: 0 (省略されないといけない) filesAnalyzedがFalseの場合

source: [Checksum] is a checksum of the external document following the checksum format defined in section 3.9.
ja: [Checksum]は、3.9節で定義されているチェックサム フォーマットに従って記載される外部文書のチェックサムである。

source: [SPDX Document URI] is the unique ID for the external document
ja: [SPDX Document URI]は、2.5節で定義されているように、対象文書を参照している外部文書の一意のIDである

source: [SPDX Document URI] is the unique ID for the external document as defined in section 2.5 of that referenced document,
ja: [SPDX Document URI]は、2.5節で定義されているように、対象文書を参照している外部文書の一意のIDである。

source: [idstring] is a unique string containing letters, numbers, “.”, or “-”
ja: [idstring]は、文字、数字、“.”、“­”を含む一意の文字列。

source: [idstring] is a unique string containing letters, numbers, “.”, “-” or “+”.
ja: [idstring]は、文字、数字、“.”、“­”または“+”を含む一意の文字列。

source: [idstring] is a unique string containing letters, numbers, “.”, “?” or “+”.
ja: [idstring]は、文字、数字、“.”、“­”または“+”を含む一意の文字列。

source: [idstring] is a unique string containing letters, numbers, “.”, “­” or “+”.
ja: [idstring]は、文字、数字、“.”、“­”または“+”を含む一意の文字列。

source: checksum ­ the checksum of the referenced SPDX document
ja: checksum ­ 参照されるSPDX文書のチェックサム

source: exceptions:
ja: 例外を含む：

source: free form text that can span multiple
ja: 自由形式文（複数行に渡ってもよい）。

source: git and git+git are equivalent.
ja: gitとgit+gitは同じである。

source: hh is hours with leading zero in 24 hour time mm is minutes with leading zero
ja: hhは時間（左0詰め、24時間表記） mmは分（左0詰め）

source: https://pip.pypa.io/en/latest/reference/pip_install.html#vcs-support as of 20150220) supports referencing locations in version control systems such as Git, Mercurial, Subversion and Bazaar, and specifies the type of VCS tool using url prefixes: “git+”, “hg+”, “bzr+”, “svn+” and specific transport schemes such as SSH or HTTPS.
ja: https://pip.pypa.io/en/latest/reference/pip_install.html#vcs­support 20150220時点) は、Git、Mercurial、Subversion、Bazaarなどのバージョン コントロール システム内の位置参照をサポートする。URL接頭子：: “git+”, “hg+”, “bzr+”, “svn+”とSSHやHTTPのようなトランスポート スキーム を使ってVCSツール タイプを特定する。

source: https://pip.pypa.io/en/latest/reference/pip_install.html#vcs?support as of 20150220) supports referencing locations in version control systems such as Git, Mercurial, Subversion and Bazaar, and specifies the type of VCS tool using url prefixes: “git+”, “hg+”, “bzr+”, “svn+” and specific transport schemes such as SSH or HTTPS.
ja: https://pip.pypa.io/en/latest/reference/pip_install.html#vcs­support 20150220時点) は、Git、Mercurial、Subversion、Bazaarなどのバージョン コントロール システム内の位置参照をサポートする。URL接頭子：: “git+”, “hg+”, “bzr+”, “svn+”とSSHやHTTPのようなトランスポート スキーム を使ってVCSツール タイプを特定する。

source: https://pip.pypa.io/en/latest/reference/pip_install.html#vcs­support as of 20150220) supports referencing locations in version control systems such as Git, Mercurial, Subversion and Bazaar, and specifies the type of VCS tool using url prefixes: “git+”, “hg+”, “bzr+”, “svn+” and specific transport schemes such as SSH or HTTPS.
ja: https://pip.pypa.io/en/latest/reference/pip_install.html#vcs­support 20150220時点) は、Git、Mercurial、Subversion、Bazaarなどのバージョン コントロール システム内の位置参照をサポートする。URL接頭子：: “git+”, “hg+”, “bzr+”, “svn+”とSSHやHTTPのようなトランスポート スキーム を使ってVCSツール タイプを特定する。

source: in RDF, it is delimited by
ja: RDFでは、

source: or
ja: または

source: single line of text with the following
ja: 以下のキーワードが続く一文のテキスト

source: spdxDocument ­ the SpdxDocument being referenced
ja: spdxDocument ­ 参照されるSDPX文書

source: ss is seconds with leading zero Z is universal time indicator
ja: ss は秒（左0詰め） Z は協定世界時指示子

source: sub?packages, but the information in this section is a reference to the entire contents of the package listed.
ja: サブ パッケージを含むことができるが、この節の情報は、リストされたパッケージのコンテンツ全体への参照である。

source: sub­packages, but the information in this section is a reference to the entire contents of the package listed. Starting with SPDX 2.0, it is not necessary to have a package wrapping a set of files.
ja: サブ パッケージを含むことができるが、この節の情報は、リストされたパッケージのコンテンツ全体への参照である。SPDX 2.0を使う場合には、ファイルセットを包含するパッケージは必ずしも必要ではない。

source: svn and svn+svn are equivalent.
ja: svnとsvn+svnは同じである。

source: the SpdxDocument being referenced
ja: 参照されるSDPX文書

source: the checksum of the referenced SPDX document
ja: 参照されるSPDX文書のチェックサム

source: the SPDX file creator has attempted to but cannot reach a reasonable objective determination;
ja: SPDXファイル作成者が、特定を試みたが、対象を合理的に決定できなかった

source: the SPDX file creator has intentionally provided no information (no meaning should be implied by doing so).
ja: SPDXファイル作成者が、意図的に情報を提供しなかった（意味がないことを、そうすることで暗示するべきである）

source: the SPDX file creator has made no attempt to determine this field; or
ja: SPDXファイル作成者が、このフィールドを決定しようと試みなかった

source: this two forms are equivalent:
ja: この二つの形式は同じである：

source: to represent that a proper Universal Resource Indicator (URI) should be present.
ja: 適切な統一資源指示子（URI）が提示されるべきであることを示す

source: uniform resource locator | “NONE” |
ja: uniform resource locator（URL） | “NONE” |

source: where [idstring] is a unique string containing letters, numbers,
ja: ここで、[idstring] は一意の文字、数字、“.”、“­”を含む文字列。

source: where [idstring] is a unique string containing letters, numbers, “.”,“-”.
ja: ここで、[idstring] は一意の文字、数字、“.”、“­”を含む文字列。

source: “DocumentRef-”[idstring] is an optional reference to an external SPDX document as described in section 2.6
ja: “DocumentRef-”[idstring] は、2.6節で記述される外部SPDX文書への任意の参照

source: ”Person: person name” and optional “(email)” "Organization: organization” and optional “(email)”
ja: "Organization:" 組織名および任意で"("email")"を付加

source: ● A new Package Information section (via Package Name) denotes the start of another package.
ja: ● 新しいパッケージ情報セクションは、（PackageNameを通じて）他のパッケージ開始を示す。

source: ● A new Package Information section is denoted by the Package Name field.
ja: ● 新しいパッケージ情報セクションは、パッケージ名フィールドで示される。

source: ● A user defined license reference denoted by LicenseRef-[idstring] (for a license not on the SPDX License List);
ja: ● ライセンスがSPDXラインセスリストにない場合には、LicenseRef-[idstring] で示すユーザー定義参照；

source: ● A valid SPDX License Expression as defined in Appendix IV;
ja: ● Appendix IVで定義された正しいSPDXライセンス表現：

source: ● All Package Information fields must be grouped together before the start of a Files section, if file(s) are present.
ja: ● ファイルがある場合、すべてのパッケージ情報フィールドは、ファイル セクション開始前にすべてグループ化されなければならない。

source: ● All files contained in a package must immediately follow the applicable Package Information.
ja: ● パッケージに含まれるすべてのファイルは、適用可能なパッケージ情報に直接従わなければならない。

source: ● Annotations and Relationships for the package may appear after the Package Information before any file information.
ja: ● パッケージのAnnotationsとRelationshipsは、パッケージ情報の後で、ファイル情報の前に置かれる。

source: ● NOASSERTION if:
ja: ● 以下の場合は、NOASSERTION：

source: ● NOASSERTION, if:
ja: ● 以下の場合には、NOASSERTION：

source: ● NONE, if no license information is detected in any of the files; or
ja: ● どのファイルからもライセンスが検出されない場合には、NONE：

source: ● NONE, if the SPDX file creator concludes there is no license available for this package; or
ja: ● このパッケージに適用できるライセンスが無い場合、NONE；または

source: ● Sub-packages should not be nested inside a Package Information section, but should be separate and should use a Relationship to clarify.
ja: ● サブパッケージをパッケージ情報セクション中で入れ子にするべきではない。分離するべきである。明確にするためにRelationshipを使うべきである。

source: ● Sub?packages should not be nested inside a Package Information section, but should be separate and should use a Relationship to clarify.
ja: ● サブパッケージをパッケージ情報セクション中で入れ子にするべきではない。分離するべきである。明確にするためにRelationshipを使うべきである。

source: ● The SPDX Document URI cannot contain a URI "part" (e.g. the "#" delimiter), since the "#" is used to uniquely identify SPDX element identifiers.
ja: ● SPDX文書URIはURI "part"（例えば ‘#’）を持てない。というのも‘#’は、SPDX要素識別子を特定するために使われるからである。

source: ● The SPDX License List short form identifier, if a detected license is on the SPDX License List;
ja: ● 検出されたライセンスがSPDXラインセスリストにある場合には、SPDX License List short form identifier（SPDXライセンス簡易形式識別子）；

source: ● The URI must contain a scheme (e.g. “https:”).
ja: ● URIは、スキーム（例えば“https:”）を含まなければならない。

source: ● Use NOASSERTION if:
ja: ● 以下の場合にはNOASSERTIONを使用する。

source: ● Use NONE if there is no download location whatsoever.
ja: ● ダウンロード位置が一切ない場合にはNONEを使う。

source: ● Use NONE if there is no package home page whatsoever.
ja: ● パッケージ ホームページが無い場合にはNONEを使用する。

source: ● checksum - the checksum of the referenced SPDX document
ja: ● checksum - 参照されるSPDX文書のチェックサム

source: ● spdxDocument - the SpdxDocument being referenced
ja: ● spdxDocument - 参照されるSPDX文書
